#!/bin/bash

echo "
 ▄▄· ▄▄▄  ▄▄▄ .·▄▄▄▄  ▪  ▄▄▄▄▄.▄▄ · 
▐█ ▌▪▀▄ █·▀▄.▀·██▪ ██ ██ •██  ▐█ ▀. 
██ ▄▄▐▀▀▄ ▐▀▀▪▄▐█· ▐█▌▐█· ▐█.▪▄▀▀▀█▄
▐███▌▐█•█▌▐█▄▄▌██. ██ ▐█▌ ▐█▌·▐█▄▪▐█
·▀▀▀ .▀  ▀ ▀▀▀ ▀▀▀▀▀• ▀▀▀ ▀▀▀  ▀▀▀▀ 
" | lolcat -a -i
echo "developer channel: https://www.youtube.com/channel/UCaVBnB4CQxiW6-Nuhmi1gqA" | lolcat -i -a
echo "whatsapp from developer +1 (737) 271-6772 im from brazil" | lolcat -i -a
echo "colaborador: Lealzim STK" | lolcat -a -i
sleep 5
clear

echo "
██████╗ ███████╗███████╗██████╗      ██████╗ █████╗ ████████╗
██╔══██╗██╔════╝██╔════╝██╔══██╗    ██╔════╝██╔══██╗╚══██╔══╝
██████╔╝█████╗  █████╗  ██████╔╝    ██║     ███████║   ██║   
██╔══██╗██╔══╝  ██╔══╝  ██╔══██╗    ██║     ██╔══██║   ██║   
██████╔╝███████╗███████╗██║  ██║    ╚██████╗██║  ██║   ██║   
╚═════╝ ╚══════╝╚══════╝╚═╝  ╚═╝     ╚═════╝╚═╝  ╚═╝   ╚═╝   
" | lolcat -a -i
PS3='----->: ' | lolcat -i -a
echo "
install ngrok(1)
install metasploit(2)
install wiki termux(3)
install all(A)
exit(E)
" | lolcat -i -a
options=("1" "2" "3" "A" "e" "E")
select opt in "${options[@]}"
do
    case $opt in
        "1")
        clear
 echo "
 ▪   ▐ ▄ .▄▄ · ▄▄▄▄▄ ▄▄▄· ▄▄▌  ▄▄▌  ▪   ▐ ▄  ▄▄ •    ▐ ▄  ▄▄ • ▄▄▄        ▄ •▄ 
██ •█▌▐█▐█ ▀. •██  ▐█ ▀█ ██•  ██•  ██ •█▌▐█▐█ ▀ ▪  •█▌▐█▐█ ▀ ▪▀▄ █· ▄█▀▄ █▌▄▌▪
▐█·▐█▐▐▌▄▀▀▀█▄ ▐█.▪▄█▀▀█ ██ ▪ ██ ▪ ▐█·▐█▐▐▌▄█ ▀█▄  ▐█▐▐▌▄█ ▀█▄▐▀▀▄ ▐█▌.▐▌▐▀▀▄·
▐█▌██▐█▌▐█▄▪▐█ ▐█▌·▐█▪ ▐▌▐█▌ ▄▐█▌ ▄▐█▌██▐█▌▐█▄▪▐█  ██▐█▌▐█▄▪▐█▐█•█▌▐█▌.▐▌▐█.█▌
▀▀▀▀▀ █▪ ▀▀▀▀  ▀▀▀  ▀  ▀ .▀▀▀ .▀▀▀ ▀▀▀▀▀ █▪·▀▀▀▀   ▀▀ █▪·▀▀▀▀ .▀  ▀ ▀█▄▀▪·▀  ▀

 " | lolcat -i -a
    {
    
pkg update && pkg upgrade -y
pkg install zip wget -y
wget https://bin.equinox.io/c/4VmDzA7iaHb/ngrok-stable-linux-arm.zip
unzip ngrok-stable-linux-arm.zip
chmod +x ngrok

} 1>/dev/null
  
  echo "✴.·´¯`·.·★  🎀𝓼𝓾𝓬𝓬𝓮𝓼𝓼𝓯𝓾𝓵𝓵𝔂 𝓲𝓷𝓼𝓽𝓪𝓵𝓵𝓮𝓭🎀  ★·.·`¯´·.✴" | lolcat -a
  sleep 3
            ;;
        "2")
        clear
 echo "
 █ █▄ █ ▄▀▀ ▀█▀ ▄▀▄ █   █   █ █▄ █ ▄▀    █▄ ▄█ ██▀ ▀█▀ ▄▀▄ ▄▀▀ █▀▄ █   ▄▀▄ █ ▀█▀
 █ █ ▀█ ▄██  █  █▀█ █▄▄ █▄▄ █ █ ▀█ ▀▄█   █ ▀ █ █▄▄  █  █▀█ ▄██ █▀  █▄▄ ▀▄▀ █  █ 
                                             
 " | lolcat - i-a

     {
pkg update && pkg upgrade -y && pkg install wget curl openssh git -y
cd $HOME
wget Auxilus.github.io/metasploit.sh
pkg update && pkg upgrade -y && pkg install curl wget tsu wget git && wget Auxilus.github.io/metasploit.sh && bash metasploit.sh

} 1>/dev/null
  echo ""
sleep 3
            ;;
        "3")
        clear
     echo "
  ██▓ ███▄    █   ██████ ▄▄▄█████▓ ▄▄▄       ██▓    ▓█████▓█████▄ 
▒▓██▒ ██ ▀█   █ ▒██    ▒ ▓  ██▒ ▓▒▒████▄    ▓██▒    ▓█   ▀▒██▀ ██▌
▒▒██▒▓██  ▀█ ██▒░ ▓██▄   ▒ ▓██░ ▒░▒██  ▀█▄  ▒██░    ▒███  ░██   █▌
░░██░▓██▒  ▐▌██▒  ▒   ██▒░ ▓██▓ ░ ░██▄▄▄▄██ ▒██░    ▒▓█  ▄░▓█▄   ▌
░░██░▒██░   ▓██░▒██████▒▒  ▒██▒ ░ ▒▓█   ▓██▒░██████▒░▒████░▒████▓ 
 ░▓  ░ ▒░   ▒ ▒ ▒ ▒▓▒ ▒ ░  ▒ ░░   ░▒▒   ▓▒█░░ ▒░▓  ░░░ ▒░  ▒▒▓  ▒ 
░ ▒ ░░ ░░   ░ ▒░░ ░▒  ░ ░    ░    ░ ░   ▒▒ ░░ ░ ▒  ░ ░ ░   ░ ▒  ▒ 
░ ▒ ░   ░   ░ ░ ░  ░  ░    ░        ░   ▒     ░ ░      ░   ░ ░  ░ 
  ░           ░       ░                 ░  ░    ░  ░   ░     ░    
                                                             


     " | lolcat -i -a
        {
git clone https://github.com/HarrisSec/wiki-termux
} 1>/dev/null
 
       sleep 3 
            ;;
        "4")
      echo "
━━━━━━━━┏┓━━━━━┓━┓━━━━━━━━━━━━━━━┓━┓━
━━━━━━━━┛┗┓━━━━┃━┃━━━━━━━━━━━━━━━┃━┃━
┏┓━┓━━━┓┓┏┛━━┓━┃━┃━┓━┓━━━┓━━━━━┓━┃━┃━
┣┫┏┓┓━━┫┃┃━━┓┃━┃━┃━┫┏┓┓┏┓┃━━━━┓┃━┃━┃━
┃┃┃┃┃━━┃┃┗┓┗┛┗┓┗┓┗┓┃┃┃┃┗┛┃━━━┗┛┗┓┗┓┗┓
┗┛┛┗┛━━┛┗━┛━━━┛━┛━┛┛┛┗┛━┓┃━━━━━━┛━┛━┛
━━━━━━━━━━━━━━━━━━━━━━━━┛┃━━━━━━━━━━━
━━━━━━━━━━━━━━━━━━━━━━━━━┛━━━━━━━━━━━

      " | lolcat -i -a
   
 echo "
            ╔╗      ╔╗ ╔╗       ╔╗                         ╔╗ ╔╗            
          ╔╝╚╗     ║║ ║║       ║║                        ╔╝╚╗║║            
╔╗╔═╗ ╔══╗╚╗╔╝╔══╗ ║║ ║║ ╔══╗╔═╝║    ╔══╗╔╗╔╗╔══╗╔═╗╔╗ ╔╗╚╗╔╝║╚═╗╔╗╔═╗ ╔══╗
╠╣║╔╗╗║══╣ ║║ ╚ ╗║ ║║ ║║ ║╔╗║║╔╗║    ║╔╗║║╚╝║║╔╗║║╔╝║║ ║║ ║║ ║╔╗║╠╣║╔╗╗║╔╗║
║║║║║║╠══║ ║╚╗║╚╝╚╗║╚╗║╚╗║║═╣║╚╝║    ║║═╣╚╗╔╝║║═╣║║ ║╚═╝║ ║╚╗║║║║║║║║║║║╚╝║
╚╝╚╝╚╝╚══╝ ╚═╝╚═══╝╚═╝╚═╝╚══╝╚══╝    ╚══╝ ╚╝ ╚══╝╚╝ ╚═╗╔╝ ╚═╝╚╝╚╝╚╝╚╝╚╝╚═╗║
                                                    ╔═╝║               ╔═╝║
                                                    ╚══╝               ╚══╝

 " | lolcat -i
 
  {
git clone https://github.com/HarrisSec/wiki-termux
pkg update && pkg upgrade -y && pkg install wget curl openssh git -y
cd $HOME
wget Auxilus.github.io/metasploit.sh
pkg update && pkg upgrade -y && pkg install curl wget tsu wget git && wget Auxilus.github.io/metasploit.sh && bash metasploit.sh
pkg update && pkg upgrade -y
pkg install zip wget -y
wget https://bin.equinox.io/c/4VmDzA7iaHb/ngrok-stable-linux-arm.zip
unzip ngrok-stable-linux-arm.zip
chmod +x ngrok
} 1>/dev/null

clear
echo "
 | lolcat -i -a
  sleep 3
            ;;
        "e")
            break
            ;;
        "E")
            break
            ;;
        *) echo "invalid option $REPLY";;
    esac
done
exit
